#ifndef BATTERY_H_
#define BATTERY_H_
//====================================//
// インクルード
//====================================//
#include "main.h"
//====================================//
// シンボル定義
//====================================//

//====================================//
// グローバル変数の宣言
//====================================//
extern uint16_t motorCurrentL, motorCurrentR, batteryVal;
//====================================//
// プロトタイプ宣言
//====================================//
void getADC2(void);
void showBattery (void);

#endif // BATTERY_H_
