#ifndef WS2812C_H_
#define WS2812C_H_

//====================================//
// インクルード
//====================================//
#include "main.h"
//====================================//
// シンボル定義
//====================================//
#define BUFFER_SIZW_LED 32
//====================================//
// グローバル変数の宣言
//====================================//
// extern int32_t ledBuff;     // 送信バッファ
// extern bool    ledsend = false;    // 送信フラグ
// extern uint8_t ledCntBit;     // 送信bitのカウント

//====================================//
// プロトタイプ宣言
//====================================//
void ledset(uint8_t r, uint8_t g, uint8_t b);
void sendColorData(void);

#endif // WS2812C_H_
